chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx210f016c.h
PLIB_INLINE SFR_TYPE* _USB_EP10_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP10;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP10_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP10;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP11_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP11;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP11_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP11;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP11_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP11;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP11_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP11;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP11_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP11;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP12_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP12_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP12_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP12_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP12_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP12;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP13_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP13_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP13_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP13_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP13_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP13;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP14_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP14_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP14_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP14_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP14_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP14;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP15_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP15_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP15_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP15;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

